app/Controllers/AHPController.php

SELECT *
FROM `tbl_kriteria`
---
    public function index()
    {
        $data = [
            'judul' => 'Sistem AHP',
            'subjudul' => 'Sistem AHP',
            'menu' => 'ahp',
            'submenu' => '',
            'page' => 'ahp/input_pairwise',
            'kriterias' => $this->ModelKriteria->findAll()

SELECT *
FROM `tbl_kriteria`
---
    public function hitungBobot()
    {
        $kriterias = $this->ModelKriteria->findAll();