app/Controllers/HasilAHPController.php

SELECT *
FROM `tbl_user`
WHERE `level` = 3
SELECT *
FROM `tbl_kriteria`
SELECT *
FROM `tbl_penilaian`
WHERE `id_user` = '3'
AND `id_kriteria` = '1'
 LIMIT 1
---
    public function index()
    {
        // Ambil semua mahasiswa calon
        $mahasiswa = $this->ModelUser->where('level', 3)->findAll();
        $kriteria = $this->ModelKriteria->findAll();

        // Ambil bobot kriteria dari hasil AHP
        $bobotKriteria = [];
        foreach ($kriteria as $k) {
            $bobotKriteria[$k['id_kriteria']] = $k['bobot_kriteria']; // pastikan sudah dihitung sebelumnya
        }

        $hasil = [];

        foreach ($mahasiswa as $mhs) {
            $totalSkor = 0;

            // Ambil nilai penilaian mahasiswa per kriteria
            foreach ($kriteria as $k) {
                $penilaian = $this->ModelPenilaian
                    ->where('id_user', $mhs['id_user'])
                    ->where('id_kriteria', $k['id_kriteria'])
                    ->first();