app/Controllers/Home.php

    public function ProsesRegister()
    {
        $validation = \Config\Services::validation();

        // Validasi input
        $valid = $this->validate([
            'nama_user' => 'required',
            'email' => 'required|valid_email|is_unique[tbl_user.email]',
            'password' => 'required|min_length[8]',
        ]);

        if (!$valid) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $data = [
            'nama_user' => $this->request->getPost('nama_user'),
            'email' => $this->request->getPost('email'),
            'password' => sha1($this->request->getPost('password')),
            'level' => 3, // default level 3 untuk user baru
        ];

        $userModel = new \App\Models\ModelUser();
        $userModel->insert($data);
---
INSERT INTO `tbl_user` (`nama_user`, `email`, `password`, `level`) VALUES ('Calon Penerima 4', 'calon4@gmail.com', '88ea39439e74fa27c09a4fc0bc8ebe6d00978392', 3)