app/Controllers/MahasiswaController.php

    public function simpan()
    {
        $idUser = session()->get('id_user');
        if (!$idUser) {
            return redirect()->to('/login'); // Jika belum login
        }

        $user = $this->userModel->find($idUser);
        $idMahasiswa = $user['id_mahasiswa'];

        $dataMahasiswa = [
            'jenjang'       => $this->request->getPost('jenjang'),
            'nim'           => $this->request->getPost('nim'),
            'fakultas'      => $this->request->getPost('fakultas'),
            'program_studi' => $this->request->getPost('program_studi'),
            'ipk'           => $this->request->getPost('ipk'),
            'semester'      => $this->request->getPost('semester'),
        ];

        if ($idMahasiswa) {
            // Sudah punya data -> lakukan update
            $this->mahasiswaModel->update($idMahasiswa, $dataMahasiswa);
        } else {
            // Belum punya data -> insert lalu simpan id ke user
            $idMahasiswaBaru = $this->mahasiswaModel->insert($dataMahasiswa, true);
            $this->userModel->update($idUser, [
                'id_mahasiswa' => $idMahasiswaBaru
            ]);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id_user` = '6'
INSERT INTO `tbl_mahasiswa` (`jenjang`, `nim`, `fakultas`, `program_studi`, `ipk`, `semester`) VALUES ('Diploma Tiga D3', '202529383', 'Teknik', 'Teknik Komputer', '3.30', '7')
UPDATE `tbl_user` SET `id_mahasiswa` = 5
WHERE `tbl_user`.`id_user` IN ('6')