app/Controllers/PenilaianController.php

    public function index()
    {
        $data = [
            'judul'     => 'Penilaian Mahasiswa',
            'subjudul'  => 'Input Nilai',
            'menu'      => 'penilaian',
            'submenu'   => '',
            'page'      => 'penilaian/form_nilai',
            'mahasiswa' => $this->ModelUser->where('level', 3)->findAll(),
            'kriteria'  => $this->ModelKriteria->findAll(),
            'subkriteria' => $this->ModelSubKriteria->findAll(),
---
SELECT *
FROM `tbl_user`
WHERE `level` = 3
SELECT *
FROM `tbl_kriteria`
SELECT *
FROM `tbl_sub_kriteria`