app/Models/ModelKriteria.php

SELECT *
FROM `tbl_kriteria`
---
    public function AllData()
    {
        return $this->db->table('tbl_kriteria')
            ->get()
            ->getResultArray();

DELETE FROM `tbl_kriteria`
WHERE `id_kriteria` = '4'
AND `id_kriteria` = '4'
---
    public function DeleteData($data)
    {
        $this->db->table('tbl_kriteria')
            ->where('id_kriteria', $data['id_kriteria'])
            ->delete($data);