app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
---
    public function AllData()
    {
        return $this->db->table('tbl_user')
            ->get()
            ->getResultArray();

INSERT INTO `tbl_user` (`nama_user`, `email`, `password`, `level`) VALUES ('Calon Test', 'test@gmail.com', '88ea39439e74fa27c09a4fc0bc8ebe6d00978392', '3')
---
    public function InsertData($data)
    {
        $this->db->table('tbl_user')->insert($data);

UPDATE `tbl_user` SET `id_user` = '4', `nama_user` = 'Calon Test', `email` = 'test1@gmail.com', `level` = '3'
WHERE `id_user` = '4'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_user')
            ->where('id_user', $data['id_user'])
            ->update($data);

SELECT *
FROM `tbl_user`
WHERE `email` = 'calon4@gmail.com'
AND `password` = '88ea39439e74fa27c09a4fc0bc8ebe6d00978392'
---
    public function LoginUser($email, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'email' => $email,
                'password' => $password,
            ])->get()->getRowArray();