app/Models/ModelAdmin.php

    public function JumlahKriteria()
    {
        return $this->db->table('tbl_kriteria')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kriteria`

    public function JumlahSubKriteria()
    {
        return $this->db->table('tbl_sub_kriteria')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_sub_kriteria`

    public function JumlahMahasiswa()
    {
        return $this->db->table('tbl_mahasiswa')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_mahasiswa`

    public function JumlahUser()
    {
        return $this->db->table('tbl_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`