app/Models/ModelSubKriteria.php

    public function AllData()
    {
        return $this->db->table('tbl_sub_kriteria')
            ->join('tbl_kriteria', 'tbl_kriteria.id_kriteria=tbl_sub_kriteria.id_kriteria')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_sub_kriteria`
JOIN `tbl_kriteria` ON `tbl_kriteria`.`id_kriteria`=`tbl_sub_kriteria`.`id_kriteria`